code/README.md
```mermaid
sequenceDiagram
    
    participant C as Client
    participant AAD as Azure AD
    participant R as Resource Server

   
    C ->>+AAD: request access token
    AAD ->>- C: access token
   
    
    C ->> R: api call with token acquired
    activate C
    R ->> AAD:  validate token
    R ->> R: serve
    R ->> C: response
    deactivate C
```
